#+TITLE:Teaching data science with literate programming tools: a mighty fortress against the dangers of AI-assisted coding
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE:Oklahoma Univ Data Science Workshop 22 March 2024
#+STARTUP:overview hideblocks indent

([[https://github.com/birkenkrahe/org/blob/master/research/oklahoma_2024.org][Abstract / Announcement]])

* Literate programming

Moving on to literate programming. On the surface of it, it's a
technique developed by Donald Knuth in the 1980s alongside his
typesetting system TeX later popularized in scientific publishing
through Leslie Lamport's LaTeX.

I cannot remember the day or the hour when I got hooked to literate
programming - It may initially just have been an issue of status
because literate sounds well, so literate. But the real reason for
doing it was that I had a huge number of sources, interests,
contacts. And I was already indulging in a tendency to impatiently
write code before I had fully understood what I wanted to do. Now, for
physicists, a key component of our training is postponing the moment
of truth and extending the time spent on understanding what it is you
actually want to address. Computer scientists, it seems to me, on the
whole, tend to be more impatient. Perhaps because their main tool, the
machine, favors instant gratification. While physicists, at least
theoretical physicists, are more like mathematicians, and less like
engineers. At least that's my experience (otherwise not qualified by
systematic investigation).

Whatever the history, you may already have picked up that literary
programming requires some patience. In a nutshell, paraphrasing the
words of its inventor, it is an approach to programming that is for
humans rather than machines. A literary program consists of
documentation, source code, and output, and can be processed to
generate printable documentation and compilable source code of files.

This approach was popularized in data science early on through Jupyter
notebooks, which most of you will know. These notebooks allow data
scientists to explore data while keeping a notebook of their ideas and
intermediate results open as a basis for publication and sharing. The
name "Jupyter" comes from three popular interpreted languages, Julia,
Python, and R. The IPython shell runs Python, and for another language
you need to install/load the respective kernel. Kernels are now
available for compiled languages, too, to add REPL functionality. You
cannot run more than one of these languages in a given notebook at the
same time. This is one of the reasons to switch to Emacs + Org-mode
(see below).

While the general idea of literate programs and the accompanying
style, literate programming, is simple, there are different
implementations. For example, in Emacs Org-mode, a lightweight tool to
add true literate programming functionality is with =noweb=. It is
language-agnostic, that is it can be used with any programming
language.

*Noweb* supports the notion of tangling and weaving:
- Tangling is the process of extracting the program's source code from
  the literate programming document, making it ready for compilation.
- Weaving generates human-readable documentation from the same
  document, including both the narrative text, the embedded code, and
  potential output, formatted in a way that's suitable for reading and
  understanding the program's structure and logic.

In Emacs Org-mode files, you flag a code block with =:noweb yes= for
inclusion of other named code blocks. Here is an example that uses
Org-mode code blocks in Emacs - but =noweb= could also be used as a
standalone literate programming tool.

The named code block =hello_world= below contains an R function. The
next code block uses
#+begin_example org
#+name: def
#+begin_src R :results silent :session *R*
  hello <- function() {
    return ("Hello, world!")
    }
#+end_src
#+name: use "hello world" function hello()
#+begin_src R :noweb yes :session *R* :tangle hello.R
  <<def>>
  hello()
#+end_src

#+RESULTS: use "hello world" function hello()
: Hello, world!
#+end_example

The tangled source code looks like this - =noweb= works like a
preprocessor that substitutes =def= for =<<def>>=.
#+begin_example
hello <- function() {
  return ("Hello, world!")
  }

## call hello
hello()
#+end_example

Other implementations of Knuth's idea include his original tools WEB
(for Pascal) and CWEB (for C), Org-mode for Emacs, Jupyter notebooks,
R Markdown (with the =knitr= package), and even "literate Haskell". I
have no experience with literate Haskell, but I have used all of the
other implementations, with Emacs + Org-mode my favorite tool by far.

I will explain later how I use literate programming in my
teaching. But first let me briefly summarize some perhaps unexpected
challenges of data science education.

